{
  "blogs": [
    {
      "title": "The Supernaturals",
      "body": "John Winchester raised his two sons Sam and Dean to hunt and kill all things that go \"bump in the night\" after his wife Mary was murdered by an evil supernatural being when the boys were little. 22 years later the brothers set out on a journey, fighting evil along the way, to find their recently-missing father; when they finally do he reveals he knows what demon killed their mother and has found a way to track and kill it. Meanwhile, Sam develops frightening abilities such as seeing visions of people dying before it actually happens. These visions are somehow connected to the demon that murdered his mother and its mysterious plans that seem to be all about Sam. When their father dies striking a deal with that very same demon, the brothers determine to finish his crusade. But disturbing revelations about Sam's part in the demon's apocalyptic plan are presented when John's dying last words to Dean are revealed",
      "author": "mario",
      "id": 1
    },
    {
      "title": "Always and Forever",
      "body": "Always and Forever is the vow that was made long ago by members of the Mikaelson Family, and members of Dahlia and Esther's Family Bloodline, specifically a promise made between Esther Mikaelson and her sister Dahlia in the late 10th century, during which they vowed to never leave each other's side. \"Always and Forever\" was then used as a promise again by Esther to her son Klaus many years later to assure him that she would always be there for him if he was scared. Later Klaus, Elijah and Rebekah made the same promise to stick together, after their family had split up following the death of their mother. This promise, in any iteration, has been broken sixteen known times in its history - 2 times by Esther in the late 10th century, 5 known times by Rebekah in 1919, in 2011, in 2012 and in 2013, 2 known times by Elijah  in 2012 and in 2013, and 7 known times by Klaus in 1001, in 1835, in 1922, in 2010 (twice), in 2011 and in 2013.\n\nIn the 21st century, the original promise was renewed between Elijah, Klaus, Rebekah, and their brother Kol after they were reunited as siblings for the first time in years. Klaus reminded his maternal younger half-brother of this promise again in I Love You, Goodbye, when it became clear that Kol was dying from a hex. In Behind the Black Horizon, it is cemented that this vow also includes Finn and Freya.",
      "author": "yoshi",
      "id": 4
    },
    {
      "title": "Inception",
      "body": "Dom Cobb is a skilled thief, the absolute best in the dangerous art of extraction, stealing valuable secrets from deep within the subconscious during the dream state, when the mind is at its most vulnerable. Cobb's rare ability has made him a coveted player in this treacherous new world of corporate espionage, but it has also made him an international fugitive and cost him everything he has ever loved. Now Cobb is being offered a chance at redemption. One last job could give him his life back but only if he can accomplish the impossible, inception. Instead of the perfect heist, Cobb and his team of specialists have to pull off the reverse: their task is not to steal an idea, but to plant one. If they succeed, it could be the perfect crime. But no amount of careful planning or expertise can prepare the team for the dangerous enemy that seems to predict their every move. An enemy that only Cobb could have seen coming.—Warner Bros. Pictures\n",
      "author": "yoshi",
      "id": 2
    },
    {
      "title": "The Dark",
      "body": "Children start vanishing from the German town of Winden,bringing to light the fractured relationships, double lives, and dark past of four families living there, and revealing a mystery that spans four generations.  The story begins in 2019, but spreads to include story-lines in 1986 and 1953 via time travel, as certain characters of the show's core families grow aware of the existence of a wormhole in the cave system beneath the local nuclear power plant, which is under the management of the influential Tiedemann family. During the first season, secrets begin to be revealed concerning the Kahnwald, Nielsen, Doppler, and Tiedemann families, and their lives start to crumble as the ties become evident between the missing children and the histories of the town and its citizens.  The second season continues the intertwining families' attempts to reunite with their missing loved ones, several months after the first-season finale, in 2020, 1987 and 1954, respectively. Additional story-lines set in 2053 and 1921 add new aspects to the mysteries, and the secret Sic Mundus fellowship, a major force in an underlying battle for the ultimate fate of the people of Winden, is explored, as the season counts down towards the apocalypse – a supposed destruction of Winden and death of many of its citizens.  The third and final season follows the families across time in the wake of the apocalypse in 2020, while also introducing a parallel world whose events are interconnected with those of the first world. The season is primarily set in 1888, 1987, 2020 and 2053 in the first world, and 2019 and 2052 in the second world, as the characters work to find a way out of the repeating cycle of events in Winden across both worlds.",
      "author": "chas",
      "id": 3
    },
    {
      "title": "Harry Potter",
      "body": "Harry Potter was first introduced in the novel Harry Potter and the Philosopher’s Stone (1997; also published as Harry Potter and the Sorcerer’s Stone), as an orphan who is mistreated by his guardian aunt and uncle and their son. On his 11th birthday Harry discovers that his parents were a witch and a wizard and that he, a wizard himself, has been invited to attend Hogwarts School of Witchcraft and Wizardry. He also learns that his parents had not perished in a car accident, as his aunt and uncle had told him, but that they instead had been murdered by an evil wizard named Voldemort. Harry was the only person to have ever survived an attack by Voldemort—by somehow rebounding the latter’s “killing curse”—which left him with a lightning-bolt-shaped scar on his forehead. Indeed, Harry’s mysterious survival had all but killed Voldemort, who was left disembodied, and the young boy was thus already a celebrated figure in the “wizarding” community. At Hogwarts Harry becomes fast friends with classmates Ron Weasley and Hermione Granger and finds a rival in Draco Malfoy. He is taken under the wing of the school’s headmaster, Albus Dumbledore. These relationships persist throughout the series, especially as the young wizards and witches grow older and are called upon to take sides in a growing wizard war.",
      "author": "mario",
      "id": 5
    }
  ]
}